app/controllers/admin/achievements_controller.rb

SELECT `achievements`.* FROM `achievements` WHERE (trashed_at IS NULL) ORDER BY `achievements`.`created_at` DESC
---
  def index
    @achievements = Achievement.all.decorate