app/controllers/admin/learners_controller.rb

  def index
    @learners = Learner
      .joins("LEFT OUTER JOIN trackers AS active_trackers ON active_trackers.learner_id = learners.id
        AND active_trackers.trashed_at IS NULL")
      .joins("LEFT OUTER JOIN trackers AS inactive_trackers ON inactive_trackers.learner_id = learners.id
        AND inactive_trackers.trashed_at IS NOT NULL")
      .joins("LEFT OUTER JOIN achievements ON achievements.learner_id = learners.id")
      .joins("LEFT OUTER JOIN
        ( SELECT a1.*
         FROM achievements AS a1
         LEFT JOIN achievements AS a2 ON a1.learner_id = a2.learner_id
         AND a1.created_at < a2.created_at
         WHERE a2.learner_id IS NULL ) AS achievements_last ON achievements_last.learner_id = learners.id")
      .select("learners.*")
      .select("achievements_last.created_at AS achievement_date")
      .select("achievements_last.description AS achievement_description")
      .select("COUNT(DISTINCT active_trackers.id) AS active_count")
      .select("COUNT(DISTINCT inactive_trackers.id) AS inactive_count")
      .select("COUNT(DISTINCT achievements.id) AS achievements_count")
      .group('learners.id')
---
SELECT learners.*, achievements_last.created_at AS achievement_date, achievements_last.description AS achievement_description, COUNT(DISTINCT active_trackers.id) AS active_count, COUNT(DISTINCT inactive_trackers.id) AS inactive_count, COUNT(DISTINCT achievements.id) AS achievements_count FROM `learners` LEFT OUTER JOIN trackers AS active_trackers ON active_trackers.learner_id = learners.id

  def edit
    @learner = Learner.find params[:id]
---
SELECT `learners`.* FROM `learners` WHERE `learners`.`id` = 9 LIMIT 1

  def update
    @learner = Learner.find params[:id]

    if @learner.update_attributes(learner_params)
---
SELECT `learners`.* FROM `learners` WHERE `learners`.`id` = 37 LIMIT 1
UPDATE `learners` SET `password_digest` = '$2a$10$exLFhQe72VdvSLtIWLL6H.dcmyONaRsEitSr966y7JX4c5WO8m7bm', `updated_at` = '2014-09-09 09:14:34' WHERE `learners`.`id` = 37