app/controllers/sessions_controller.rb

  def create
    learner = Learner.find_by_email(params[:email])
---
SELECT `learners`.* FROM `learners` WHERE `learners`.`email` = 'martyn.evans@unboxedconsulting.com' LIMIT 1